app/controllers/assignments_controller.rb

SELECT "assignments".* FROM "assignments"
---
    def index
        render json: Assignment.all

SELECT "assignments".* FROM "assignments" WHERE "assignments"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def show
        assign = Assignment.find(params[:id])

INSERT INTO "assignments" ("title", "content", "klass_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "work"], ["content", "woooork"], ["klass_id", 22], ["created_at", "2020-06-09 20:59:18.274325"], ["updated_at", "2020-06-09 20:59:18.274325"]]
SELECT "assignments".* FROM "assignments" WHERE "assignments"."id" = ? LIMIT ?  [["id", 121], ["LIMIT", 1]]
---
    def create
        #   byebug
        a = Assignment.create(
            title: params[:title],
            content: params[:content],
            deadline: params[:startDate],
            klass_id: params[:klassId])

        assign = Assignment.find(a.id)

SELECT "assignments".* FROM "assignments" WHERE "assignments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "assignments" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "assignments"."id" = ?  [["title", "m4_a1 05/20/20"], ["content", "Finish!"], ["updated_at", "2020-06-10 05:45:59.894712"], ["id", 1]]
---
    def update
        assign = Assignment.find(params[:id])

        assign.update(
            title: params[:title],
            content: params[:content],
            deadline: params[:startDate]
        )

SELECT "assignments".* FROM "assignments" WHERE "assignments"."id" = ? LIMIT ?  [["id", 41], ["LIMIT", 1]]
DELETE FROM "assignments" WHERE "assignments"."id" = ?  [["id", 41]]
---
    def destroy
        assign = Assignment.find(params[:id])
        assign.destroy()