app/controllers/klasses_controller.rb

    def index
        render json: Klass.all, include: :assignments
---
SELECT "assignments".* FROM "assignments" WHERE "assignments"."klass_id" = ?  [["klass_id", 1]]
SELECT "klasses".* FROM "klasses"

    def show
        klass = Klass.find(params[:id])
---
SELECT "klasses".* FROM "klasses" WHERE "klasses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]