app/controllers/students_controller.rb

    def index
        render json: Student.all
---
SELECT "students".* FROM "students"

    def show
        student = Student.find(params[:id])
---
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]