app/controllers/teachers_controller.rb

SELECT "teachers".* FROM "teachers"
---
    def index
        render json: Teacher.all

SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
    def show
        teacher= Teacher.find(params[:id])